#set的運算
#s1 = [1,2,3,4,5]#假設宣告變數是[1,2,3,4,5]
#print(s1)#結果是[1,2,3,4,5]
#s1 = [1,2,3,4,5]#假設宣告變數是[1,2,3,4,5]
#print(s1[0])#結果是1
#s1 = [1,2,3,4,5]
#s2 = [3,5,6]
#print(s1,s2)#結果是[1,2,3,4,5] [3,5,6]
#print(s1[3],s2[1])#結果出來是4、5
#s1 = [5,4,1,6]#
#print(s1[:2])#用索引方式來刷取數字

#加入索引(列表)
s1=[1,2,2,2]
p = s1.count(2)#抓取s1的計數
print(p)#n=3
# s2=[11,77]
# #s1.append(7)#加入7的數字
# #s1.insert(5,7)#位置五加入7的數字出來
# s1.extend(s2)#把s2加入到s1裡面
# print(11 in s1)#利用in方式確認有沒有在裡面
# #刪除索引(列表)
# del s1[3]
# print(s1)
# #dictionary的運算
# s3 = {"tony":1,"fida":2,"bida":3}
# print(s3.values())#執行找到它的值
# s3 = {"tony":1,"fida":2,"bida":3}
# print(s3.items())#執行找到它的組合
# s3 = {"tony":1,"fida":2,"bida":3}
# del s3["tony"]#刪除第一個字典
# print(s3)#執行剩下兩個
# s3 = {"tony":1,"fida":2,"bida":3}
# print(s3.get("tony"))#取得鍵對應的值，如果鍵不存在的話，它對應的值自然傳回參數的值

